"Scan for Large and Old Files" = "Zoek naar grote en oude bestanden";
"Erase with CleanMyMac" = "Wis met CleanMyMac";
"Securely Erase with CleanMyMac" = "Wis veilig met CleanMyMac";
"Clean with CleanMyMac" = "Ruim op met CleanMyMac";
"Uninstall with CleanMyMac" = "Verwijder met CleanMyMac";
"Clean iPhoto Library with CleanMyMac" = "Ruim iPhoto-bibliotheek op met CleanMyMac";
